zephyrproject-rtos/zephyr/drivers/modem/nordic/nrf91_slm.c
/*
 * Copyright 2025 Nova Dynamics LLC
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT nordic_nrf91_slm

#include <zephyr/kernel.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/pm/device.h>

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(nrf91_slm, CONFIG_MODEM_LOG_LEVEL);

#include <string.h>
#include <stdlib.h>

#include <zephyr/net/offloaded_netdev.h>
#include <zephyr/net/socket_offload.h>

#include "nrf91_slm.h"

#define PERIODIC_SCRIPT_TIMEOUT K_MSEC(CONFIG_MODEM_NRF91_SLM_PERIODIC_SCRIPT_MS)

/* Magic constants */
#define CSQ_RSSI_UNKNOWN  (99)
#define CESQ_RSRP_UNKNOWN (255)
#define CESQ_RSRQ_UNKNOWN (255)

/* Magic numbers to units conversions */
#define CSQ_RSSI_TO_DB(v)  (-113 + (2 * (rssi)))
#define CESQ_RSRP_TO_DB(v) (-140 + (v))
#define CESQ_RSRQ_TO_DB(v) (-20 + ((v) / 2))

enum nrf91_slm_event {
	NRF91_SLM_EVENT_RESUME = 0,
	NRF91_SLM_EVENT_SUSPEND,
	NRF91_SLM_EVENT_SCRIPT_SUCCESS,
	NRF91_SLM_EVENT_SCRIPT_FAILED,
	NRF91_SLM_EVENT_TIMEOUT,
	NRF91_SLM_EVENT_REGISTERED,
	NRF91_SLM_EVENT_DEREGISTERED,
	NRF91_SLM_EVENT_PPP_CONNECTED,
	NRF91_SLM_EVENT_PPP_DISCONNECTED,
};

struct nrf91_slm_config {
	const struct device *uart;
	struct gpio_dt_spec power_gpio;
	struct gpio_dt_spec reset_gpio;
	uint16_t power_pulse_duration_ms;
	uint16_t reset_pulse_duration_ms;
	uint16_t startup_time_ms;
	uint16_t shutdown_time_ms;
	bool autostarts;
};

static struct nrf91_slm_data mdata;

static const struct nrf91_slm_config mconfig = {
	.uart = DEVICE_DT_GET(DT_INST_BUS(0)),
	.power_gpio = GPIO_DT_SPEC_INST_GET_OR(0, mdm_power_gpios, {}),
	.reset_gpio = GPIO_DT_SPEC_INST_GET_OR(0, mdm_reset_gpios, {}),
	.power_pulse_duration_ms = 100,
	.reset_pulse_duration_ms = 100,
	.startup_time_ms = 2000,
	.shutdown_time_ms = 10000,
	.autostarts = false,
};

/******************************************************************************
 * Logging functions
 *****************************************************************************/

#if defined(CONFIG_LOG) && (CONFIG_MODEM_LOG_LEVEL == LOG_LEVEL_DBG)

static const char *nrf91_slm_state_str(enum nrf91_slm_state state)
{
	switch (state) {
	case NRF91_SLM_STATE_IDLE:
		return "idle";
	case NRF91_SLM_STATE_RESET_PULSE:
		return "reset pulse";
	case NRF91_SLM_STATE_POWER_ON_PULSE:
		return "power pulse";
	case NRF91_SLM_STATE_AWAIT_POWER_ON:
		return "await power on";
	case NRF91_SLM_STATE_RUN_INIT_SCRIPT:
		return "run init script";
	case NRF91_SLM_STATE_AWAIT_REGISTERED:
		return "await registered";
	case NRF91_SLM_STATE_DISCONNECT_PPP:
		return "disconnect ppp";
	case NRF91_SLM_STATE_RUN_DIAL_SCRIPT:
		return "run dial script";
	case NRF91_SLM_STATE_CARRIER_ON:
		return "carrier on";
	case NRF91_SLM_STATE_INIT_POWER_OFF:
		return "init power off";
	case NRF91_SLM_STATE_POWER_OFF_PULSE:
		return "power off pulse";
	case NRF91_SLM_STATE_AWAIT_POWER_OFF:
		return "await power off";
	}

	return "";
}

static const char *nrf91_slm_event_str(enum nrf91_slm_event event)
{
	switch (event) {
	case NRF91_SLM_EVENT_RESUME:
		return "resume";
	case NRF91_SLM_EVENT_SUSPEND:
		return "suspend";
	case NRF91_SLM_EVENT_SCRIPT_SUCCESS:
		return "script success";
	case NRF91_SLM_EVENT_SCRIPT_FAILED:
		return "script failed";
	case NRF91_SLM_EVENT_TIMEOUT:
		return "timeout";
	case NRF91_SLM_EVENT_REGISTERED:
		return "registered";
	case NRF91_SLM_EVENT_DEREGISTERED:
		return "deregistered";
	case NRF91_SLM_EVENT_PPP_CONNECTED:
		return "ppp connected";
	case NRF91_SLM_EVENT_PPP_DISCONNECTED:
		return "ppp disconnected";
	}

	return "";
}

static void nrf91_slm_log_state_changed(enum nrf91_slm_state last_state,
					enum nrf91_slm_state new_state)
{
	LOG_DBG("switch from %s to %s", nrf91_slm_state_str(last_state),
		nrf91_slm_state_str(new_state));
}

static void nrf91_slm_log_event(enum nrf91_slm_event evt)
{
	LOG_DBG("event %s", nrf91_slm_event_str(evt));
}

#endif

/******************************************************************************
 * Helper functions
 *****************************************************************************/

static bool nrf91_slm_gpio_is_enabled(const struct gpio_dt_spec *gpio)
{
	return gpio->port != NULL;
}

static void nrf91_slm_start_timer(struct nrf91_slm_data *data, k_timeout_t timeout)
{
	k_work_schedule(&data->timeout_work, timeout);
}

static void nrf91_slm_stop_timer(struct nrf91_slm_data *data)
{
	k_work_cancel_delayable(&data->timeout_work);
}

static void nrf91_slm_try_run_script(struct nrf91_slm_data *data,
				     const struct modem_chat_script *script)
{
	int ret = k_mutex_lock(&data->chat_lock, K_NO_WAIT);

	if (ret == 0) {
		ret = modem_chat_run_script_async(&data->chat, script);
		k_mutex_unlock(&data->chat_lock);
	}

	if (ret < 0) {
		nrf91_slm_start_timer(data, PERIODIC_SCRIPT_TIMEOUT);
		LOG_DBG("rescheduled %s (%d)", script->name, ret);
	}
}

static void nrf91_slm_delegate_event(struct nrf91_slm_data *data, enum nrf91_slm_event evt)
{
	k_mutex_lock(&data->event_rb_lock, K_FOREVER);
	ring_buf_put(&data->event_rb, (uint8_t *)&evt, 1);
	k_mutex_unlock(&data->event_rb_lock);
	k_work_submit(&data->event_dispatch_work);
}

static bool nrf91_slm_is_registered(struct nrf91_slm_data *data)
{
	return (data->registration_status_gsm == CELLULAR_REGISTRATION_REGISTERED_HOME) ||
	       (data->registration_status_gsm == CELLULAR_REGISTRATION_REGISTERED_ROAMING) ||
	       (data->registration_status_gprs == CELLULAR_REGISTRATION_REGISTERED_HOME) ||
	       (data->registration_status_gprs == CELLULAR_REGISTRATION_REGISTERED_ROAMING) ||
	       (data->registration_status_lte == CELLULAR_REGISTRATION_REGISTERED_HOME) ||
	       (data->registration_status_lte == CELLULAR_REGISTRATION_REGISTERED_ROAMING);
}

/******************************************************************************
 * Modem chat callbacks
 *****************************************************************************/

static void nrf91_slm_chat_callback_handler(struct modem_chat *chat,
					    enum modem_chat_script_result result, void *user_data)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)user_data;

	if (result == MODEM_CHAT_SCRIPT_RESULT_SUCCESS) {
		nrf91_slm_delegate_event(data, NRF91_SLM_EVENT_SCRIPT_SUCCESS);
	} else {
		nrf91_slm_delegate_event(data, NRF91_SLM_EVENT_SCRIPT_FAILED);
	}
}

