zephyrproject-rtos/zephyr/drivers/modem/nordic/nrf91_slm.c
static void nrf91_slm_chat_on_imei(struct modem_chat *chat, char **argv, uint16_t argc,
				   void *user_data)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)user_data;

	if (argc != 2) {
		return;
	}

	strncpy(data->imei, argv[1], sizeof(data->imei) - 1);
}

static void nrf91_slm_chat_on_cgmm(struct modem_chat *chat, char **argv, uint16_t argc,
				   void *user_data)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)user_data;

	if (argc != 2) {
		return;
	}

	strncpy(data->model_id, argv[1], sizeof(data->model_id) - 1);
}

static void nrf91_slm_chat_on_cgmi(struct modem_chat *chat, char **argv, uint16_t argc,
				   void *user_data)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)user_data;

	if (argc != 2) {
		return;
	}

	strncpy(data->manufacturer, argv[1], sizeof(data->manufacturer) - 1);
}

static void nrf91_slm_chat_on_cgmr(struct modem_chat *chat, char **argv, uint16_t argc,
				   void *user_data)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)user_data;

	if (argc != 2) {
		return;
	}

	strncpy(data->fw_version, argv[1], sizeof(data->fw_version) - 1);
}

static void nrf91_slm_chat_on_csq(struct modem_chat *chat, char **argv, uint16_t argc,
				  void *user_data)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)user_data;

	if (argc != 3) {
		return;
	}

	data->rssi = (uint8_t)atoi(argv[1]);
}

static void nrf91_slm_chat_on_cesq(struct modem_chat *chat, char **argv, uint16_t argc,
				   void *user_data)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)user_data;

	if (argc != 7) {
		return;
	}

	data->rsrq = (uint8_t)atoi(argv[5]);
	data->rsrp = (uint8_t)atoi(argv[6]);
}

static void nrf91_slm_chat_on_iccid(struct modem_chat *chat, char **argv, uint16_t argc,
				    void *user_data)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)user_data;

	if (argc != 2) {
		return;
	}

	strncpy(data->iccid, argv[1], sizeof(data->iccid) - 1);
}

static void nrf91_slm_chat_on_imsi(struct modem_chat *chat, char **argv, uint16_t argc,
				   void *user_data)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)user_data;

	if (argc != 2) {
		return;
	}

	strncpy(data->imsi, argv[1], sizeof(data->imsi) - 1);
}

static void nrf91_slm_chat_on_cxreg(struct modem_chat *chat, char **argv, uint16_t argc,
				    void *user_data)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)user_data;
	enum cellular_registration_status registration_status = 0;

	/* This receives both +C*REG? read command answers and unsolicited notifications.
	 * Their syntax differs in that the former has one more parameter, <n>, which is first.
	 */
	if (argc >= 3 && argv[2][0] != '"') {
		/* +CEREG: <n>,<stat>[,<tac>[...]] */
		registration_status = atoi(argv[2]);
	} else if (argc >= 2) {
		/* +CEREG: <stat>[,<tac>[...]] */
		registration_status = atoi(argv[1]);
	} else {
		return;
	}

	if (strcmp(argv[0], "+CREG: ") == 0) {
		data->registration_status_gsm = registration_status;
	} else if (strcmp(argv[0], "+CGREG: ") == 0) {
		data->registration_status_gprs = registration_status;
	} else { /* CEREG */
		data->registration_status_lte = registration_status;
	}

	if (nrf91_slm_is_registered(data)) {
		nrf91_slm_delegate_event(data, NRF91_SLM_EVENT_REGISTERED);
	} else {
		nrf91_slm_delegate_event(data, NRF91_SLM_EVENT_DEREGISTERED);
	}
}

static void nrf91_slm_chat_on_xppp(struct modem_chat *chat, char **argv, uint16_t argc,
				   void *user_data)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)user_data;
	int status = atoi(argv[1]);

	if (status) {
		nrf91_slm_delegate_event(data, NRF91_SLM_EVENT_PPP_CONNECTED);
	} else {
		nrf91_slm_delegate_event(data, NRF91_SLM_EVENT_PPP_DISCONNECTED);
	}
}

MODEM_CHAT_MATCH_DEFINE(ok_match, "OK", "", NULL);
MODEM_CHAT_MATCHES_DEFINE(allow_match, MODEM_CHAT_MATCH("OK", "", NULL),
			  MODEM_CHAT_MATCH("ERROR", "", NULL));

MODEM_CHAT_MATCH_DEFINE(imei_match, "", "", nrf91_slm_chat_on_imei);
MODEM_CHAT_MATCH_DEFINE(cgmm_match, "", "", nrf91_slm_chat_on_cgmm);
MODEM_CHAT_MATCH_DEFINE(csq_match, "+CSQ: ", ",", nrf91_slm_chat_on_csq);
MODEM_CHAT_MATCH_DEFINE(cesq_match, "+CESQ: ", ",", nrf91_slm_chat_on_cesq);
MODEM_CHAT_MATCH_DEFINE(qccid_match __maybe_unused, "+QCCID: ", "", nrf91_slm_chat_on_iccid);
MODEM_CHAT_MATCH_DEFINE(iccid_match __maybe_unused, "+ICCID: ", "", nrf91_slm_chat_on_iccid);
MODEM_CHAT_MATCH_DEFINE(cimi_match __maybe_unused, "", "", nrf91_slm_chat_on_imsi);
MODEM_CHAT_MATCH_DEFINE(cgmi_match __maybe_unused, "", "", nrf91_slm_chat_on_cgmi);
MODEM_CHAT_MATCH_DEFINE(cgmr_match __maybe_unused, "", "", nrf91_slm_chat_on_cgmr);

MODEM_CHAT_MATCHES_DEFINE(unsol_matches, MODEM_CHAT_MATCH("+CREG: ", ",", nrf91_slm_chat_on_cxreg),
			  MODEM_CHAT_MATCH("+CEREG: ", ",", nrf91_slm_chat_on_cxreg),
			  MODEM_CHAT_MATCH("+CGREG: ", ",", nrf91_slm_chat_on_cxreg),
			  MODEM_CHAT_MATCH("#XPPP: ", ",", nrf91_slm_chat_on_xppp),
			  MODEM_CHAT_MATCH("#XDATAMODE: ", "", NULL));

MODEM_CHAT_MATCHES_DEFINE(abort_matches, MODEM_CHAT_MATCH("ERROR", "", NULL));

MODEM_CHAT_MATCHES_DEFINE(dial_abort_matches, MODEM_CHAT_MATCH("ERROR", "", NULL),
			  MODEM_CHAT_MATCH("BUSY", "", NULL),
			  MODEM_CHAT_MATCH("NO ANSWER", "", NULL),
			  MODEM_CHAT_MATCH("NO CARRIER", "", NULL),
			  MODEM_CHAT_MATCH("NO DIALTONE", "", NULL));

MODEM_CHAT_SCRIPT_CMDS_DEFINE(
	nordic_nrf91_slm_init_chat_script_cmds, MODEM_CHAT_SCRIPT_CMD_RESP_MULT("AT", allow_match),
	MODEM_CHAT_SCRIPT_CMD_RESP("AT+CMEE=1", ok_match),
	MODEM_CHAT_SCRIPT_CMD_RESP("AT+CEREG=1", ok_match),
	MODEM_CHAT_SCRIPT_CMD_RESP("AT+CEREG?", ok_match),
	MODEM_CHAT_SCRIPT_CMD_RESP("AT+CGSN", imei_match), MODEM_CHAT_SCRIPT_CMD_RESP("", ok_match),
	MODEM_CHAT_SCRIPT_CMD_RESP("AT+CGMM", cgmm_match), MODEM_CHAT_SCRIPT_CMD_RESP("", ok_match),
	MODEM_CHAT_SCRIPT_CMD_RESP("AT+CGMI", cgmi_match), MODEM_CHAT_SCRIPT_CMD_RESP("", ok_match),
	MODEM_CHAT_SCRIPT_CMD_RESP("AT+CGMR", cgmr_match),
	MODEM_CHAT_SCRIPT_CMD_RESP("", ok_match));

MODEM_CHAT_SCRIPT_DEFINE(nordic_nrf91_slm_init_chat_script, nordic_nrf91_slm_init_chat_script_cmds,
			 abort_matches, nrf91_slm_chat_callback_handler, 10);

MODEM_CHAT_SCRIPT_CMDS_DEFINE(nordic_nrf91_slm_dial_chat_script_cmds,
			      MODEM_CHAT_SCRIPT_CMD_RESP("AT+CFUN=4", ok_match),
			      MODEM_CHAT_SCRIPT_CMD_RESP("AT+CFUN=1", ok_match));

MODEM_CHAT_SCRIPT_DEFINE(nordic_nrf91_slm_dial_chat_script, nordic_nrf91_slm_dial_chat_script_cmds,
			 dial_abort_matches, nrf91_slm_chat_callback_handler, 10);

MODEM_CHAT_SCRIPT_CMDS_DEFINE(nordic_nrf91_slm_periodic_chat_script_cmds,
			      MODEM_CHAT_SCRIPT_CMD_RESP("AT+CEREG?", ok_match));

