zephyrproject-rtos/zephyr/drivers/modem/nordic/nrf91_slm.c
MODEM_CHAT_SCRIPT_DEFINE(nordic_nrf91_slm_periodic_chat_script,
			 nordic_nrf91_slm_periodic_chat_script_cmds, abort_matches,
			 nrf91_slm_chat_callback_handler, 4);

MODEM_CHAT_SCRIPT_CMDS_DEFINE(nordic_nrf91_slm_ppp_chat_script_cmds,
			      MODEM_CHAT_SCRIPT_CMD_RESP("AT#XPPP=0", ok_match),
			      MODEM_CHAT_SCRIPT_CMD_RESP("AT#XPPP?", ok_match));

MODEM_CHAT_SCRIPT_DEFINE(nordic_nrf91_slm_ppp_chat_script, nordic_nrf91_slm_ppp_chat_script_cmds,
			 abort_matches, nrf91_slm_chat_callback_handler, 10);

/******************************************************************************
 * Modem state machine
 *****************************************************************************/

static void nrf91_slm_enter_state(struct nrf91_slm_data *data, enum nrf91_slm_state state);

static void nrf91_slm_timeout_handler(struct k_work *item)
{
	struct k_work_delayable *dwork = k_work_delayable_from_work(item);
	struct nrf91_slm_data *data = CONTAINER_OF(dwork, struct nrf91_slm_data, timeout_work);

	nrf91_slm_delegate_event(data, NRF91_SLM_EVENT_TIMEOUT);
}

static void nrf91_slm_begin_power_off_pulse(struct nrf91_slm_data *data)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;

	if (nrf91_slm_gpio_is_enabled(&config->power_gpio)) {
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_POWER_OFF_PULSE);
	} else {
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_IDLE);
	}
}

static int nrf91_slm_on_idle_state_enter(struct nrf91_slm_data *data)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;
	int ret;

	if (nrf91_slm_gpio_is_enabled(&config->reset_gpio)) {
		gpio_pin_set_dt(&config->reset_gpio, 1);
	}

	modem_chat_release(&data->chat);
	ret = modem_pipe_close(data->uart_pipe, K_SECONDS(2));
	if (ret < 0) {
		LOG_ERR("failed to close pipe");
	}

	data->registration_status_gsm = CELLULAR_REGISTRATION_NOT_REGISTERED;
	data->registration_status_gprs = CELLULAR_REGISTRATION_NOT_REGISTERED;
	data->registration_status_lte = CELLULAR_REGISTRATION_NOT_REGISTERED;

	k_sem_give(&data->suspended_sem);
	return ret;
}

static void nrf91_slm_idle_event_handler(struct nrf91_slm_data *data, enum nrf91_slm_event evt)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;
	int ret;

	switch (evt) {
	case NRF91_SLM_EVENT_RESUME:
		ret = modem_pipe_open(data->uart_pipe, K_SECONDS(2));
		if (ret < 0) {
			LOG_ERR("failed to open pipe");
			return;
		}

		modem_chat_attach(&data->chat, data->uart_pipe);

		if (config->autostarts) {
			nrf91_slm_enter_state(data, NRF91_SLM_STATE_AWAIT_POWER_ON);
			break;
		}

		if (nrf91_slm_gpio_is_enabled(&config->power_gpio)) {
			nrf91_slm_enter_state(data, NRF91_SLM_STATE_POWER_ON_PULSE);
			break;
		}

		if (nrf91_slm_gpio_is_enabled(&config->reset_gpio)) {
			nrf91_slm_enter_state(data, NRF91_SLM_STATE_AWAIT_POWER_ON);
			break;
		}

		nrf91_slm_enter_state(data, NRF91_SLM_STATE_RUN_INIT_SCRIPT);
		break;

	case NRF91_SLM_EVENT_SUSPEND:
		k_sem_give(&data->suspended_sem);
		break;

	default:
		break;
	}
}

static int nrf91_slm_on_idle_state_leave(struct nrf91_slm_data *data)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;

	k_sem_take(&data->suspended_sem, K_NO_WAIT);

	if (nrf91_slm_gpio_is_enabled(&config->reset_gpio)) {
		gpio_pin_set_dt(&config->reset_gpio, 0);
	}

	return 0;
}

static int nrf91_slm_on_reset_pulse_state_enter(struct nrf91_slm_data *data)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;

	gpio_pin_set_dt(&config->reset_gpio, 1);
	nrf91_slm_start_timer(data, K_MSEC(config->reset_pulse_duration_ms));
	return 0;
}

static void nrf91_slm_reset_pulse_event_handler(struct nrf91_slm_data *data,
						enum nrf91_slm_event evt)
{
	switch (evt) {
	case NRF91_SLM_EVENT_TIMEOUT:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_AWAIT_POWER_ON);
		break;

	case NRF91_SLM_EVENT_SUSPEND:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_IDLE);
		break;

	default:
		break;
	}
}

static int nrf91_slm_on_reset_pulse_state_leave(struct nrf91_slm_data *data)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;

	gpio_pin_set_dt(&config->reset_gpio, 0);
	nrf91_slm_stop_timer(data);
	return 0;
}

static int nrf91_slm_on_power_on_pulse_state_enter(struct nrf91_slm_data *data)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;

	gpio_pin_set_dt(&config->power_gpio, 1);
	nrf91_slm_start_timer(data, K_MSEC(config->power_pulse_duration_ms));
	return 0;
}

static void nrf91_slm_power_on_pulse_event_handler(struct nrf91_slm_data *data,
						   enum nrf91_slm_event evt)
{
	switch (evt) {
	case NRF91_SLM_EVENT_TIMEOUT:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_AWAIT_POWER_ON);
		break;

	case NRF91_SLM_EVENT_SUSPEND:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_IDLE);
		break;

	default:
		break;
	}
}

static int nrf91_slm_on_power_on_pulse_state_leave(struct nrf91_slm_data *data)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;

	gpio_pin_set_dt(&config->power_gpio, 0);
	nrf91_slm_stop_timer(data);
	return 0;
}

static int nrf91_slm_on_await_power_on_state_enter(struct nrf91_slm_data *data)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;

	nrf91_slm_start_timer(data, K_MSEC(config->startup_time_ms));
	return 0;
}

static void nrf91_slm_await_power_on_event_handler(struct nrf91_slm_data *data,
						   enum nrf91_slm_event evt)
{
	switch (evt) {
	case NRF91_SLM_EVENT_TIMEOUT:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_RUN_INIT_SCRIPT);
		break;

	case NRF91_SLM_EVENT_SUSPEND:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_IDLE);
		break;

	default:
		break;
	}
}

static int nrf91_slm_on_run_init_script_state_enter(struct nrf91_slm_data *data)
{
	nrf91_slm_try_run_script(data, &nordic_nrf91_slm_init_chat_script);
	return 0;
}

static void nrf91_slm_run_init_script_event_handler(struct nrf91_slm_data *data,
						    enum nrf91_slm_event evt)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;

	switch (evt) {
	case NRF91_SLM_EVENT_SCRIPT_SUCCESS:
		net_if_set_link_addr(data->netif, data->imei, ARRAY_SIZE(data->imei),
				     NET_LINK_UNKNOWN);

		nrf91_slm_enter_state(data, NRF91_SLM_STATE_RUN_DIAL_SCRIPT);
		break;

