zephyrproject-rtos/zephyr/drivers/modem/nordic/nrf91_slm.c
	case NRF91_SLM_EVENT_TIMEOUT:
		nrf91_slm_try_run_script(data, &nordic_nrf91_slm_init_chat_script);
		break;

	case NRF91_SLM_EVENT_SUSPEND:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_IDLE);
		break;

	case NRF91_SLM_EVENT_SCRIPT_FAILED:
		if (nrf91_slm_gpio_is_enabled(&config->power_gpio)) {
			nrf91_slm_enter_state(data, NRF91_SLM_STATE_POWER_ON_PULSE);
			break;
		}

		if (nrf91_slm_gpio_is_enabled(&config->reset_gpio)) {
			nrf91_slm_enter_state(data, NRF91_SLM_STATE_RESET_PULSE);
			break;
		}

		nrf91_slm_enter_state(data, NRF91_SLM_STATE_IDLE);
		break;

	default:
		break;
	}
}

static int nrf91_slm_on_run_dial_script_state_enter(struct nrf91_slm_data *data)
{
	/* Allow modem time to enter command mode before running dial script */
	nrf91_slm_start_timer(data, K_MSEC(100));
	return 0;
}

static void nrf91_slm_run_dial_script_event_handler(struct nrf91_slm_data *data,
						    enum nrf91_slm_event evt)
{
	switch (evt) {
	case NRF91_SLM_EVENT_SCRIPT_SUCCESS:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_AWAIT_REGISTERED);
		break;

	case NRF91_SLM_EVENT_TIMEOUT:
		nrf91_slm_try_run_script(data, &nordic_nrf91_slm_dial_chat_script);
		break;

	case NRF91_SLM_EVENT_SUSPEND:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_INIT_POWER_OFF);
		break;

	default:
		break;
	}
}

static int nrf91_slm_on_await_registered_state_enter(struct nrf91_slm_data *data)
{
	nrf91_slm_start_timer(data, PERIODIC_SCRIPT_TIMEOUT);
	return 0;
}

static void nrf91_slm_await_registered_event_handler(struct nrf91_slm_data *data,
						     enum nrf91_slm_event evt)
{
	switch (evt) {
	case NRF91_SLM_EVENT_SCRIPT_SUCCESS:
	case NRF91_SLM_EVENT_SCRIPT_FAILED:
		nrf91_slm_start_timer(data, PERIODIC_SCRIPT_TIMEOUT);
		break;

	case NRF91_SLM_EVENT_TIMEOUT:
		nrf91_slm_try_run_script(data, &nordic_nrf91_slm_periodic_chat_script);
		break;

	case NRF91_SLM_EVENT_SUSPEND:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_INIT_POWER_OFF);
		break;

	case NRF91_SLM_EVENT_REGISTERED:
	case NRF91_SLM_EVENT_PPP_CONNECTED:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_DISCONNECT_PPP);
		break;

	default:
		break;
	}
}

static int nrf91_slm_on_disconnect_ppp_state_enter(struct nrf91_slm_data *data)
{
	nrf91_slm_try_run_script(data, &nordic_nrf91_slm_ppp_chat_script);
	return 0;
}

static void nrf91_slm_disconnect_ppp_event_handler(struct nrf91_slm_data *data,
						   enum nrf91_slm_event evt)
{
	switch (evt) {
	case NRF91_SLM_EVENT_SCRIPT_SUCCESS:
	case NRF91_SLM_EVENT_SCRIPT_FAILED:
		nrf91_slm_start_timer(data, PERIODIC_SCRIPT_TIMEOUT);
		break;

	case NRF91_SLM_EVENT_TIMEOUT:
		nrf91_slm_try_run_script(data, &nordic_nrf91_slm_ppp_chat_script);
		break;

	case NRF91_SLM_EVENT_REGISTERED:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_CARRIER_ON);
		break;

	case NRF91_SLM_EVENT_SUSPEND:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_INIT_POWER_OFF);
		break;

	case NRF91_SLM_EVENT_PPP_DISCONNECTED:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_CARRIER_ON);
		break;

	default:
		break;
	}
}

static int nrf91_slm_on_await_registered_state_leave(struct nrf91_slm_data *data)
{
	nrf91_slm_stop_timer(data);
	return 0;
}

static int nrf91_slm_on_carrier_on_state_enter(struct nrf91_slm_data *data)
{
	net_if_carrier_on(data->netif);
	nrf91_slm_start_timer(data, PERIODIC_SCRIPT_TIMEOUT);
	return 0;
}

static void nrf91_slm_carrier_on_event_handler(struct nrf91_slm_data *data,
					       enum nrf91_slm_event evt)
{
	switch (evt) {
	case NRF91_SLM_EVENT_SCRIPT_SUCCESS:
	case NRF91_SLM_EVENT_SCRIPT_FAILED:
		nrf91_slm_start_timer(data, PERIODIC_SCRIPT_TIMEOUT);
		break;

	case NRF91_SLM_EVENT_TIMEOUT:
		nrf91_slm_try_run_script(data, &nordic_nrf91_slm_periodic_chat_script);
		break;

	case NRF91_SLM_EVENT_DEREGISTERED:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_RUN_DIAL_SCRIPT);
		break;

	case NRF91_SLM_EVENT_SUSPEND:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_INIT_POWER_OFF);
		break;

	case NRF91_SLM_EVENT_PPP_CONNECTED:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_DISCONNECT_PPP);
		break;

	default:
		break;
	}
}

static int nrf91_slm_on_carrier_on_state_leave(struct nrf91_slm_data *data)
{
	nrf91_slm_stop_timer(data);
	net_if_carrier_off(data->netif);
	modem_chat_release(&data->chat);
	return 0;
}

static int nrf91_slm_on_init_power_off_state_enter(struct nrf91_slm_data *data)
{
	nrf91_slm_start_timer(data, K_MSEC(2000));
	return 0;
}

static void nrf91_slm_init_power_off_event_handler(struct nrf91_slm_data *data,
						   enum nrf91_slm_event evt)
{
	switch (evt) {
	case NRF91_SLM_EVENT_TIMEOUT:
		nrf91_slm_begin_power_off_pulse(data);
		break;

	default:
		break;
	}
}

static int nrf91_slm_on_power_off_pulse_state_enter(struct nrf91_slm_data *data)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;

	gpio_pin_set_dt(&config->power_gpio, 1);
	nrf91_slm_start_timer(data, K_MSEC(config->power_pulse_duration_ms));
	return 0;
}

static void nrf91_slm_power_off_pulse_event_handler(struct nrf91_slm_data *data,
						    enum nrf91_slm_event evt)
{
	switch (evt) {
	case NRF91_SLM_EVENT_TIMEOUT:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_AWAIT_POWER_OFF);
		break;

	default:
		break;
	}
}

static int nrf91_slm_on_power_off_pulse_state_leave(struct nrf91_slm_data *data)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;

	gpio_pin_set_dt(&config->power_gpio, 0);
	nrf91_slm_stop_timer(data);
	return 0;
}

static int nrf91_slm_on_await_power_off_state_enter(struct nrf91_slm_data *data)
{
	const struct nrf91_slm_config *config = (const struct nrf91_slm_config *)data->dev->config;

	nrf91_slm_start_timer(data, K_MSEC(config->shutdown_time_ms));
	return 0;
}

static void nrf91_slm_await_power_off_event_handler(struct nrf91_slm_data *data,
						    enum nrf91_slm_event evt)
{
	switch (evt) {
	case NRF91_SLM_EVENT_TIMEOUT:
		nrf91_slm_enter_state(data, NRF91_SLM_STATE_IDLE);
		break;

	default:
		break;
	}
}

static int nrf91_slm_on_state_enter(struct nrf91_slm_data *data)
{
	int ret;

	switch (data->state) {
	case NRF91_SLM_STATE_IDLE:
		ret = nrf91_slm_on_idle_state_enter(data);
		break;

	case NRF91_SLM_STATE_RESET_PULSE:
		ret = nrf91_slm_on_reset_pulse_state_enter(data);
		break;

	case NRF91_SLM_STATE_POWER_ON_PULSE:
		ret = nrf91_slm_on_power_on_pulse_state_enter(data);
		break;

