zephyrproject-rtos/zephyr/drivers/modem/nordic/nrf91_slm.c
	case NRF91_SLM_STATE_AWAIT_POWER_ON:
		ret = nrf91_slm_on_await_power_on_state_enter(data);
		break;

	case NRF91_SLM_STATE_RUN_INIT_SCRIPT:
		ret = nrf91_slm_on_run_init_script_state_enter(data);
		break;

	case NRF91_SLM_STATE_RUN_DIAL_SCRIPT:
		ret = nrf91_slm_on_run_dial_script_state_enter(data);
		break;

	case NRF91_SLM_STATE_AWAIT_REGISTERED:
		ret = nrf91_slm_on_await_registered_state_enter(data);
		break;

	case NRF91_SLM_STATE_DISCONNECT_PPP:
		ret = nrf91_slm_on_disconnect_ppp_state_enter(data);
		break;

	case NRF91_SLM_STATE_CARRIER_ON:
		ret = nrf91_slm_on_carrier_on_state_enter(data);
		break;

	case NRF91_SLM_STATE_INIT_POWER_OFF:
		ret = nrf91_slm_on_init_power_off_state_enter(data);
		break;

	case NRF91_SLM_STATE_POWER_OFF_PULSE:
		ret = nrf91_slm_on_power_off_pulse_state_enter(data);
		break;

	case NRF91_SLM_STATE_AWAIT_POWER_OFF:
		ret = nrf91_slm_on_await_power_off_state_enter(data);
		break;

	default:
		ret = 0;
		break;
	}

	return ret;
}

static int nrf91_slm_on_state_leave(struct nrf91_slm_data *data)
{
	int ret;

	switch (data->state) {
	case NRF91_SLM_STATE_IDLE:
		ret = nrf91_slm_on_idle_state_leave(data);
		break;

	case NRF91_SLM_STATE_RESET_PULSE:
		ret = nrf91_slm_on_reset_pulse_state_leave(data);
		break;

	case NRF91_SLM_STATE_POWER_ON_PULSE:
		ret = nrf91_slm_on_power_on_pulse_state_leave(data);
		break;

	case NRF91_SLM_STATE_AWAIT_REGISTERED:
		ret = nrf91_slm_on_await_registered_state_leave(data);
		break;

	case NRF91_SLM_STATE_CARRIER_ON:
		ret = nrf91_slm_on_carrier_on_state_leave(data);
		break;

	case NRF91_SLM_STATE_POWER_OFF_PULSE:
		ret = nrf91_slm_on_power_off_pulse_state_leave(data);
		break;

	default:
		ret = 0;
		break;
	}

	return ret;
}

static void nrf91_slm_enter_state(struct nrf91_slm_data *data, enum nrf91_slm_state state)
{
	int ret;

	ret = nrf91_slm_on_state_leave(data);

	if (ret < 0) {
		LOG_WRN("failed to leave state, error: %i", ret);

		return;
	}

	data->state = state;
	ret = nrf91_slm_on_state_enter(data);

	if (ret < 0) {
		LOG_WRN("failed to enter state error: %i", ret);
	}
}

static void nrf91_slm_event_handler(struct nrf91_slm_data *data, enum nrf91_slm_event evt)
{
	enum nrf91_slm_state state;

	state = data->state;

#if defined(CONFIG_LOG) && (CONFIG_MODEM_LOG_LEVEL == LOG_LEVEL_DBG)
	nrf91_slm_log_event(evt);
#endif

	switch (data->state) {
	case NRF91_SLM_STATE_IDLE:
		nrf91_slm_idle_event_handler(data, evt);
		break;

	case NRF91_SLM_STATE_RESET_PULSE:
		nrf91_slm_reset_pulse_event_handler(data, evt);
		break;

	case NRF91_SLM_STATE_POWER_ON_PULSE:
		nrf91_slm_power_on_pulse_event_handler(data, evt);
		break;

	case NRF91_SLM_STATE_AWAIT_POWER_ON:
		nrf91_slm_await_power_on_event_handler(data, evt);
		break;

	case NRF91_SLM_STATE_RUN_INIT_SCRIPT:
		nrf91_slm_run_init_script_event_handler(data, evt);
		break;

	case NRF91_SLM_STATE_RUN_DIAL_SCRIPT:
		nrf91_slm_run_dial_script_event_handler(data, evt);
		break;

	case NRF91_SLM_STATE_AWAIT_REGISTERED:
		nrf91_slm_await_registered_event_handler(data, evt);
		break;

	case NRF91_SLM_STATE_DISCONNECT_PPP:
		nrf91_slm_disconnect_ppp_event_handler(data, evt);
		break;

	case NRF91_SLM_STATE_CARRIER_ON:
		nrf91_slm_carrier_on_event_handler(data, evt);
		break;

	case NRF91_SLM_STATE_INIT_POWER_OFF:
		nrf91_slm_init_power_off_event_handler(data, evt);
		break;

	case NRF91_SLM_STATE_POWER_OFF_PULSE:
		nrf91_slm_power_off_pulse_event_handler(data, evt);
		break;

	case NRF91_SLM_STATE_AWAIT_POWER_OFF:
		nrf91_slm_await_power_off_event_handler(data, evt);
		break;
	}

#if defined(CONFIG_LOG) && (CONFIG_MODEM_LOG_LEVEL == LOG_LEVEL_DBG)
	if (state != data->state) {
		nrf91_slm_log_state_changed(state, data->state);
	}
#endif
}

static void nrf91_slm_event_dispatch_handler(struct k_work *item)
{
	struct nrf91_slm_data *data =
		CONTAINER_OF(item, struct nrf91_slm_data, event_dispatch_work);

	uint8_t events[sizeof(data->event_buf)];
	uint8_t events_cnt;

	k_mutex_lock(&data->event_rb_lock, K_FOREVER);

	events_cnt = (uint8_t)ring_buf_get(&data->event_rb, events, sizeof(data->event_buf));

	k_mutex_unlock(&data->event_rb_lock);

	for (uint8_t i = 0; i < events_cnt; i++) {
		nrf91_slm_event_handler(data, (enum nrf91_slm_event)events[i]);
	}
}

/******************************************************************************
 * Cellular API
 *****************************************************************************/

MODEM_CHAT_SCRIPT_CMDS_DEFINE(get_signal_csq_chat_script_cmds,
			      MODEM_CHAT_SCRIPT_CMD_RESP("AT+CSQ", csq_match),
			      MODEM_CHAT_SCRIPT_CMD_RESP("", ok_match));

MODEM_CHAT_SCRIPT_DEFINE(get_signal_csq_chat_script, get_signal_csq_chat_script_cmds, abort_matches,
			 nrf91_slm_chat_callback_handler, 2);

static inline int nrf91_slm_csq_parse_rssi(uint8_t rssi, int16_t *value)
{
	/* AT+CSQ returns a response +CSQ: <rssi>,<ber> where:
	 * - rssi is a integer from 0 to 31 whose values describes a signal strength
	 *   between -113 dBm for 0 and -51dbM for 31 or unknown for 99
	 * - ber is an integer from 0 to 7 that describes the error rate, it can also
	 *   be 99 for an unknown error rate
	 */
	if (rssi == CSQ_RSSI_UNKNOWN) {
		return -EINVAL;
	}

	*value = (int16_t)CSQ_RSSI_TO_DB(rssi);
	return 0;
}

MODEM_CHAT_SCRIPT_CMDS_DEFINE(get_signal_cesq_chat_script_cmds,
			      MODEM_CHAT_SCRIPT_CMD_RESP("AT+CESQ", cesq_match),
			      MODEM_CHAT_SCRIPT_CMD_RESP("", ok_match));

MODEM_CHAT_SCRIPT_DEFINE(get_signal_cesq_chat_script, get_signal_cesq_chat_script_cmds,
			 abort_matches, nrf91_slm_chat_callback_handler, 2);

static inline int nrf91_slm_cesq_parse_rsrp(uint8_t rsrp, int16_t *value)
{
	if (rsrp == CESQ_RSRP_UNKNOWN) {
		return -EINVAL;
	}

	*value = (int16_t)CESQ_RSRP_TO_DB(rsrp);
	return 0;
}

static inline int nrf91_slm_cesq_parse_rsrq(uint8_t rsrq, int16_t *value)
{
	if (rsrq == CESQ_RSRQ_UNKNOWN) {
		return -EINVAL;
	}

	*value = (int16_t)CESQ_RSRQ_TO_DB(rsrq);
	return 0;
}

static int nrf91_slm_get_signal(const struct device *dev, const enum cellular_signal_type type,
				int16_t *value)
{
	int ret = -ENOTSUP;
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)dev->data;

	if ((data->state != NRF91_SLM_STATE_AWAIT_REGISTERED) &&
	    (data->state != NRF91_SLM_STATE_CARRIER_ON)) {
		return -ENODATA;
	}

