zephyrproject-rtos/zephyr/drivers/modem/nordic/nrf91_slm.c
	/* Run chat script */
	switch (type) {
	case CELLULAR_SIGNAL_RSSI:
		ret = modem_chat_run_script(&data->chat, &get_signal_csq_chat_script);
		break;

	case CELLULAR_SIGNAL_RSRP:
	case CELLULAR_SIGNAL_RSRQ:
		ret = modem_chat_run_script(&data->chat, &get_signal_cesq_chat_script);
		break;

	default:
		ret = -ENOTSUP;
		break;
	}

	/* Verify chat script ran successfully */
	if (ret < 0) {
		return ret;
	}

	/* Parse received value */
	switch (type) {
	case CELLULAR_SIGNAL_RSSI:
		ret = nrf91_slm_csq_parse_rssi(data->rssi, value);
		break;

	case CELLULAR_SIGNAL_RSRP:
		ret = nrf91_slm_cesq_parse_rsrp(data->rsrp, value);
		break;

	case CELLULAR_SIGNAL_RSRQ:
		ret = nrf91_slm_cesq_parse_rsrq(data->rsrq, value);
		break;

	default:
		ret = -ENOTSUP;
		break;
	}

	return ret;
}

static int nrf91_slm_get_modem_info(const struct device *dev, enum cellular_modem_info_type type,
				    char *info, size_t size)
{
	int ret = 0;
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)dev->data;

	switch (type) {
	case CELLULAR_MODEM_INFO_IMEI:
		strncpy(info, &data->imei[0], MIN(size, sizeof(data->imei)));
		break;
	case CELLULAR_MODEM_INFO_SIM_IMSI:
		strncpy(info, &data->imsi[0], MIN(size, sizeof(data->imsi)));
		break;
	case CELLULAR_MODEM_INFO_MANUFACTURER:
		strncpy(info, &data->manufacturer[0], MIN(size, sizeof(data->manufacturer)));
		break;
	case CELLULAR_MODEM_INFO_FW_VERSION:
		strncpy(info, &data->fw_version[0], MIN(size, sizeof(data->fw_version)));
		break;
	case CELLULAR_MODEM_INFO_MODEL_ID:
		strncpy(info, &data->model_id[0], MIN(size, sizeof(data->model_id)));
		break;
	case CELLULAR_MODEM_INFO_SIM_ICCID:
		strncpy(info, &data->iccid[0], MIN(size, sizeof(data->iccid)));
		break;
	default:
		ret = -ENODATA;
		break;
	}

	return ret;
}
static int nrf91_slm_get_registration_status(const struct device *dev,
					     enum cellular_access_technology tech,
					     enum cellular_registration_status *status)
{
	int ret = 0;
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)dev->data;

	if (data->state != NRF91_SLM_STATE_CARRIER_ON) {
		return -EAGAIN;
	}

	switch (tech) {
	case CELLULAR_ACCESS_TECHNOLOGY_GSM:
		*status = data->registration_status_gsm;
		break;
	case CELLULAR_ACCESS_TECHNOLOGY_GPRS:
	case CELLULAR_ACCESS_TECHNOLOGY_UMTS:
	case CELLULAR_ACCESS_TECHNOLOGY_EDGE:
		*status = data->registration_status_gprs;
		break;
	case CELLULAR_ACCESS_TECHNOLOGY_LTE:
	case CELLULAR_ACCESS_TECHNOLOGY_LTE_CAT_M1:
	case CELLULAR_ACCESS_TECHNOLOGY_LTE_CAT_M2:
	case CELLULAR_ACCESS_TECHNOLOGY_NB_IOT:
		*status = data->registration_status_lte;
		break;
	default:
		ret = -ENODATA;
		break;
	}

	return ret;
}

static DEVICE_API(cellular, nrf91_slm_api) = {
	.get_signal = nrf91_slm_get_signal,
	.get_modem_info = nrf91_slm_get_modem_info,
	.get_registration_status = nrf91_slm_get_registration_status,
};

/******************************************************************************
 * Power Management
 *****************************************************************************/

#ifdef CONFIG_PM_DEVICE
static int nrf91_slm_pm_action(const struct device *dev, enum pm_device_action action)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)dev->data;
	int ret;

	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		nrf91_slm_delegate_event(data, NRF91_SLM_EVENT_RESUME);
		ret = 0;
		break;

	case PM_DEVICE_ACTION_SUSPEND:
		nrf91_slm_delegate_event(data, NRF91_SLM_EVENT_SUSPEND);
		ret = k_sem_take(&data->suspended_sem, K_SECONDS(30));
		break;

	default:
		ret = -ENOTSUP;
		break;
	}

	return ret;
}

PM_DEVICE_DT_INST_DEFINE(0, nrf91_slm_pm_action);

#endif /* CONFIG_PM_DEVICE */

/******************************************************************************
 * Device Initialization
 *****************************************************************************/

static void nrf91_slm_init_pipe(const struct device *dev)
{
	const struct nrf91_slm_config *config = dev->config;
	struct nrf91_slm_data *data = dev->data;

	const struct modem_backend_uart_config uart_backend_config = {
		.uart = config->uart,
		.receive_buf = data->uart_backend_receive_buf,
		.receive_buf_size = ARRAY_SIZE(data->uart_backend_receive_buf),
		.transmit_buf = data->uart_backend_transmit_buf,
		.transmit_buf_size = ARRAY_SIZE(data->uart_backend_transmit_buf),
	};

	data->uart_pipe = modem_backend_uart_init(&data->uart_backend, &uart_backend_config);
}

static int nrf91_slm_init_chat(const struct device *dev)
{
	struct nrf91_slm_data *data = dev->data;

	const struct modem_chat_config chat_config = {
		.user_data = data,
		.receive_buf = data->chat_receive_buf,
		.receive_buf_size = ARRAY_SIZE(data->chat_receive_buf),
		.delimiter = data->chat_delimiter,
		.delimiter_size = strlen(data->chat_delimiter),
		.filter = data->chat_filter,
		.filter_size = data->chat_filter ? strlen(data->chat_filter) : 0,
		.argv = data->chat_argv,
		.argv_size = ARRAY_SIZE(data->chat_argv),
		.unsol_matches = unsol_matches,
		.unsol_matches_size = ARRAY_SIZE(unsol_matches),
	};

	return modem_chat_init(&data->chat, &chat_config);
}

static void nrf91_slm_init_socket_script(const struct device *dev)
{
	struct nrf91_slm_data *data = dev->data;

	modem_chat_match_init(&data->sock_match);
	modem_chat_match_set_separators(&data->sock_match, ",*");

	modem_chat_script_chat_init(&data->sock_script_chat);
	modem_chat_script_chat_set_response_matches(&data->sock_script_chat, &data->sock_match, 1);

	modem_chat_script_init(&data->sock_script);
	modem_chat_script_set_name(&data->sock_script, "socket");
	modem_chat_script_set_script_chats(&data->sock_script, &data->sock_script_chat, 1);
	modem_chat_script_set_abort_matches(&data->sock_script, abort_matches,
					    sizeof(abort_matches));
	modem_chat_script_set_timeout(&data->sock_script, 10);

	ring_buf_init(&data->sock_recv_rb, sizeof(data->sock_recv_rb_buf), data->sock_recv_rb_buf);
}

static int nrf91_slm_init(const struct device *dev)
{
	struct nrf91_slm_data *data = (struct nrf91_slm_data *)dev->data;
	struct nrf91_slm_config *config = (struct nrf91_slm_config *)dev->config;
	int ret;

	data->dev = dev;
	data->chat_delimiter = "\r\n";

	k_work_init_delayable(&data->timeout_work, nrf91_slm_timeout_handler);

	k_work_init(&data->event_dispatch_work, nrf91_slm_event_dispatch_handler);
	ring_buf_init(&data->event_rb, sizeof(data->event_buf), data->event_buf);

	k_sem_init(&data->suspended_sem, 0, 1);
	k_sem_init(&data->sock_sem, 0, 1);

	if (nrf91_slm_gpio_is_enabled(&config->power_gpio)) {
		ret = gpio_pin_configure_dt(&config->power_gpio, GPIO_OUTPUT_INACTIVE);
		if (ret < 0) {
			LOG_ERR("failed to configure power GPIO (%d)", ret);
			return ret;
		}
	}

	if (nrf91_slm_gpio_is_enabled(&config->reset_gpio)) {
		ret = gpio_pin_configure_dt(&config->reset_gpio, GPIO_OUTPUT_ACTIVE);
		if (ret < 0) {
			LOG_ERR("failed to configure reset GPIO (%d)", ret);
			return ret;
		}
	}

