zephyrproject-rtos/zephyr/drivers/modem/nordic/nrf91_slm.c
	nrf91_slm_init_pipe(dev);

	ret = nrf91_slm_init_chat(dev);
	if (ret < 0) {
		LOG_ERR("failed to initialize chat (%d)", ret);
		return ret;
	}

	nrf91_slm_init_socket_script(dev);

#ifndef CONFIG_PM_DEVICE
	nrf91_slm_delegate_event(data, NRF91_SLM_EVENT_RESUME);
#else
	pm_device_init_suspended(dev);
#endif /* CONFIG_PM_DEVICE */

	return 0;
}

DEVICE_DT_INST_DEFINE(0, nrf91_slm_init, PM_DEVICE_DT_INST_GET(0), &mdata, &mconfig, POST_KERNEL,
		      99, &nrf91_slm_api);

/******************************************************************************
 * Offload API
 ******************************************************************************/

static bool offload_is_supported(int family, int type, int proto)
{
	if (family != AF_INET && family != AF_INET6) {
		return false;
	}

	if (type != SOCK_DGRAM && type != SOCK_STREAM) {
		return false;
	}

	if (proto != IPPROTO_TCP && proto != IPPROTO_UDP && proto != IPPROTO_TLS_1_2) {
		return false;
	}

	return true;
}

static int offload_socket(int family, int type, int proto)
{
	return nrf91_slm_socket(&mdata, family, type, proto);
}

static ssize_t offload_read(void *obj, void *buf, size_t count)
{
	return nrf91_slm_recvfrom(&mdata, obj, buf, count, 0, NULL, NULL);
}

static ssize_t offload_write(void *obj, const void *buf, size_t count)
{
	return nrf91_slm_sendto(&mdata, obj, buf, count, 0, NULL, 0);
}

static int offload_close(void *obj)
{
	return nrf91_slm_close(&mdata, obj);
}

static int offload_ioctl(void *obj, unsigned int request, va_list args)
{
	switch (request) {
	case ZFD_IOCTL_POLL_PREPARE:
		return -EXDEV;

	case ZFD_IOCTL_POLL_UPDATE:
		return -EOPNOTSUPP;

	case ZFD_IOCTL_POLL_OFFLOAD: {
		struct zsock_pollfd *fds;
		int nfds, timeout;

		fds = va_arg(args, struct zsock_pollfd *);
		nfds = va_arg(args, int);
		timeout = va_arg(args, int);

		return nrf91_slm_poll(&mdata, fds, nfds, timeout);
	}
	default:
		errno = EINVAL;
		return -1;
	}
}

static int offload_connect(void *obj, const struct sockaddr *addr, socklen_t addrlen)
{
	return nrf91_slm_connect(&mdata, obj, addr, addrlen);
}

static ssize_t offload_sendto(void *obj, const void *buf, size_t len, int flags,
			      const struct sockaddr *dest_addr, socklen_t addrlen)
{
	return nrf91_slm_sendto(&mdata, obj, buf, len, flags, dest_addr, addrlen);
}

static ssize_t offload_recvfrom(void *obj, void *buf, size_t max_len, int flags,
				struct sockaddr *src_addr, socklen_t *addrlen)
{
	return nrf91_slm_recvfrom(&mdata, obj, buf, max_len, flags, src_addr, addrlen);
}

static ssize_t offload_sendmsg(void *obj, const struct msghdr *msg, int flags)
{
	struct modem_socket *sock = obj;
	ssize_t sent = 0;
	const char *buf;
	size_t len;
	int ret;

	if (sock->type == SOCK_DGRAM) {
		/*
		 * Current implementation only handles single contiguous fragment at a time, so
		 * prevent sending multiple datagrams.
		 */
		if (msghdr_non_empty_iov_count(msg) > 1) {
			errno = EMSGSIZE;
			return -1;
		}
	}

	for (int i = 0; i < msg->msg_iovlen; i++) {
		buf = msg->msg_iov[i].iov_base;
		len = msg->msg_iov[i].iov_len;

		while (len > 0) {
			ret = nrf91_slm_sendto(&mdata, obj, buf, len, flags, msg->msg_name,
					       msg->msg_namelen);

			if (ret < 0) {
				if (ret == -EAGAIN) {
					k_sleep(K_SECONDS(1));
				} else {
					return ret;
				}
			} else {
				sent += ret;
				buf += ret;
				len -= ret;
			}
		}
	}

	return sent;
}

static int offload_getaddrinfo(const char *node, const char *service,
			       const struct zsock_addrinfo *hints, struct zsock_addrinfo **res)
{
	return nrf91_slm_getaddrinfo(&mdata, node, service, hints, res);
}

static void offload_freeaddrinfo(struct zsock_addrinfo *res)
{
	nrf91_slm_freeaddrinfo(&mdata, res);
}

static const struct socket_op_vtable offload_socket_fd_op_vtable = {
	.fd_vtable = {
		.read = offload_read,
		.write = offload_write,
		.close = offload_close,
		.ioctl = offload_ioctl,
	},
	.bind = NULL,
	.connect = offload_connect,
	.sendto = offload_sendto,
	.recvfrom = offload_recvfrom,
	.listen = NULL,
	.accept = NULL,
	.sendmsg = offload_sendmsg,
	.getsockopt = NULL,
	.setsockopt = NULL,
};

static const struct socket_dns_offload offload_dns_ops = {
	.getaddrinfo = offload_getaddrinfo,
	.freeaddrinfo = offload_freeaddrinfo,
};

static void modem_net_iface_init(struct net_if *iface)
{
	const struct device *dev = net_if_get_device(iface);
	struct nrf91_slm_data *data = dev->data;

	net_if_set_link_addr(iface, data->imei, ARRAY_SIZE(data->imei), NET_LINK_UNKNOWN);

	data->netif = iface;

	modem_socket_init(&data->socket_config, &data->sockets[0], ARRAY_SIZE(data->sockets), 0,
			  true, &offload_socket_fd_op_vtable);

	socket_offload_dns_register(&offload_dns_ops);

	net_if_socket_offload_set(iface, offload_socket);
}

static struct offloaded_if_api api_funcs = {
	.iface_api.init = modem_net_iface_init,
};

NET_DEVICE_OFFLOAD_INIT(nrf91_slm_net_dev, "nrf91_slm_net_dev", NULL, PM_DEVICE_DT_INST_GET(0),
			&mdata, &mconfig, 98, &api_funcs, 1500);

NET_SOCKET_OFFLOAD_REGISTER(nrf91_slm_sock, CONFIG_NET_SOCKETS_OFFLOAD_PRIORITY, AF_UNSPEC,
			    offload_is_supported, offload_socket);
